#Использовать "."
#Использовать cli

#Область ОписаниеПеременных

Перем Лог;

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////

Процедура ВыполнитьПриложение()

    Приложение = Новый КонсольноеПриложение(ПараметрыПриложения.Имя(), "Помощник генерации приложения на основании шаблона cli", ЭтотОбъект);
    Приложение.Версия("v version", ПараметрыПриложения.Версия());

    // Приложение.ДобавитьКоманду("i init", "Инициализация структуры нового приложения", Новый КомандаInit);
    // Приложение.ДобавитьКоманду("g generate", "Генерация элементов структуры приложения", Новый КомандаGenerate);
    Приложение.ДобавитьКоманду("j json", "Генерация файлов json на основании информации о поддержке", Новый КомандаJson);

    Приложение.Запустить(АргументыКоманднойСтроки);

КонецПроцедуры

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьКоманду(Знач КомандаПриложения) Экспорт
    КомандаПриложения.ВывестиСправку();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

Попытка

    ВыполнитьПриложение();

Исключение

    Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	ЗавершитьРаботу(1);
КонецПопытки;
